#+TITLE: Eziam org-mode test-file
#+AUTHOR: Thibault Polge

* This is a test org-mode document
** DONE A second level header
*** A third level header

Load eziam with =load-theme=.

**** What's in the name “Eziam“?

#+begin_QUOTE
   It is a pune, or play on words (Terry Pratchett)
#+end_QUOTE

#+CAPTION: An amazing table with numbers in it (borrowed from org-mode documentation)
|---+---------+--------+--------+--------+-------+------|
|   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
|---+---------+--------+--------+--------+-------+------|
| ! |         |     P1 |     P2 |     P3 |   Tot |      |
| # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
| ^ |         |     m1 |     m2 |     m3 |    mt |      |
|---+---------+--------+--------+--------+-------+------|
| # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
| # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
|---+---------+--------+--------+--------+-------+------|
|   | Average |        |        |        |  25.0 |      |
| ^ |         |        |        |        |    at |      |
| $ | max=50  |        |        |        |       |      |
|---+---------+--------+--------+--------+-------+------|
#+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@-II..@-I);%.1f

**** And now for some Haskell

#+begin_src haskell
data EziamVariants = White | Light | Dark | Black
  deriving (Eq, Ord, Bounded, Read, Show)
#+end_src

**** And now for some more headings

***** Level 5

****** Level 6

*******  Level 7

******** Level 8

- Description lists :: are /cool/ !
